; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 17
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 12 of 17
3. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 12 of 17
4. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 12 of 17
5. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 13 of 17
6. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 13 of 17
7. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 13 of 17
8. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 13 of 17
9. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 13 of 17
10. (drop ball14 room5 right)
   deleted: (carry ball14 right)
   added: (at ball14 room5) (free right)
   goals met: 14 of 17
11. (drop ball15 room5 left)
   deleted: (carry ball15 left)
   added: (at ball15 room5) (free left)
   goals met: 15 of 17
12. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 17
13. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 15 of 17
14. (pick ball10 room4 right)
   deleted: (at ball10 room4) (free right)
   added: (carry ball10 right)
   goals met: 15 of 17
15. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 17
16. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 16 of 17
17. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 17 of 17
